# pandas

In [3]:
import pandas as pd
import numpy as np

In [40]:
series = pd.Series(np.arange(5))

In [41]:
series

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [4]:
df = pd.DataFrame({'A':[1,2,3,4],'B':['sathya','keer','guna',np.NaN]},index=range(4))

In [5]:
df

   A       B
0  1  sathya
1  2    keer
2  3    guna
3  4     NaN

In [6]:
df.columns

Index(['A', 'B'], dtype='object')

In [7]:
for i in df.columns:
    print(i)

A
B

In [8]:
df.A

0    1
1    2
2    3
3    4
Name: A, dtype: int64

In [9]:
for i in df.A:
    print(i)

1
2
3
4

In [10]:
for i in df.B:
    if i =='sathya':
        print('hii sathya welcome')
    else :
        print(i)

hii sathya welcome
keer
guna
nan

In [11]:
df.head()

   A       B
0  1  sathya
1  2    keer
2  3    guna
3  4     NaN

In [12]:
df.head(3)

   A       B
0  1  sathya
1  2    keer
2  3    guna

In [13]:
df.tail()

   A       B
0  1  sathya
1  2    keer
2  3    guna
3  4     NaN

In [14]:
df.tail(2)

   A     B
2  3  guna
3  4   NaN

In [15]:
a = df.A>3

In [16]:
a

0    False
1    False
2    False
3     True
Name: A, dtype: bool

In [17]:
df.A>2

0    False
1    False
2     True
3     True
Name: A, dtype: bool

In [18]:
df['address']=['saginekuppam','kuppam','kuppam',np.NaN]
'adding columns'

'adding columns'

In [19]:
df

   A       B       address
0  1  sathya  saginekuppam
1  2    keer        kuppam
2  3    guna        kuppam
3  4     NaN           NaN

In [20]:
for i in df.address:
    if i =='saginekuppam':
        print('hii welcome to our villege')

hii welcome to our villege

In [21]:
import numpy as np

In [19]:
a = np.array(list(range(1,11)))

In [20]:
a*3

array([ 3,  6,  9, 12, 15, 18, 21, 24, 27, 30])

In [22]:
for i in a:
    if i%2==0:
        print(i,end=' ')
    else:
        print(i*2,end=' ')

2 2 6 4 10 6 14 8 18 10

In [48]:
import csv
with open('data.csv','w',newline='') as file:
    file_obj = csv.writer(file)
    file_obj.writerow(['name','age','address'])
    file_obj.writerow(['simple','21','kuppam'])
    file_obj.writerow(['keerthana','21','kuppam'])
    file_obj.writerow(['haash','21','kuppam'])
    file_obj.writerow(['bhargavi','21','anantapuram'])
    file_obj.writerow(['swetha','21','kadapa'])

In [49]:
# with open('data.csv','r') as newfile:
#     file_obj = csv.reader(file)
#     for i in file_obj:
#         for j in i:
#             print(j)

In [50]:
import pandas as pd
file = pd.read_csv('data.csv')
print(file)

        name  age      address
0     simple   21       kuppam
1  keerthana   21       kuppam
2      haash   21       kuppam
3   bhargavi   21  anantapuram
4     swetha   21       kadapa

In [51]:
df = pd.DataFrame(file)

In [52]:
df.columns

Index(['name', 'age', 'address'], dtype='object')

In [63]:
df['cast']=['bc','bco','oc','oc','bc']

In [64]:
df

        name  age      address cast
0     simple   21       kuppam   bc
1  keerthana   21       kuppam  bco
2      haash   21       kuppam   oc
3   bhargavi   21  anantapuram   oc
4     swetha   21       kadapa   bc

In [65]:
df.name

0       simple
1    keerthana
2        haash
3     bhargavi
4       swetha
Name: name, dtype: object

In [66]:
df.age

0    21
1    21
2    21
3    21
4    21
Name: age, dtype: int64

1    21
2    21
3    21
Name: age, dtype: int64